assignments/A06.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-15 Mon 09:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Assignment 06</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="lx" />
<link rel="stylesheet" type="text/css" href="org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Assignment 06
<br />
<span class="subtitle">Assembler</span>
</h1>
<p>
This assignment is in several parts.
</p>

<p>
In total, there are 5 files to upload:
</p>
<ul class="org-ul">
<li><code>a.py</code></li>
<li><code>c.py</code></li>
<li><code>st0.py</code></li>
<li><code>st1.py</code></li>
<li><code>st2.py</code></li>
</ul>

<div id="outline-container-org1819c32" class="outline-2">
<h2 id="org1819c32">Part 1: Translate A instructions</h2>
<div class="outline-text-2" id="text-org1819c32">
<p>
Write a program, <code>a.py</code> which translates numeric-only A instructions.
</p>

<p>
Test input files for part 1: 
</p>
<ul class="org-ul">
<li><a href="./supplemental/A06/tests/a_numeric_1.asm">./supplemental/A06/tests/a_numeric_1.asm</a></li>
<li><a href="./supplemental/A06/tests/a_numeric_2.asm">./supplemental/A06/tests/a_numeric_2.asm</a> (whitespace and comments)</li>
</ul>

<p>
Your program should print the following for each of the above inputs:
</p>

<pre class="example">
0000000000101010
0000000001111011
0111111111111111
0000000000000000
0110000000000000
0100000000000000 
</pre>
</div>
</div>

<div id="outline-container-orgdfe3955" class="outline-2">
<h2 id="orgdfe3955">Part 2: Translate C instructions</h2>
<div class="outline-text-2" id="text-orgdfe3955">
<p>
Write a program, <code>c.py</code> which translates C instructions, and ignores everything else.
</p>

<p>
Test input files for part 2:
</p>
<ul class="org-ul">
<li><a href="./supplemental/A06/tests/c_1.asm">./supplemental/A06/tests/c_1.asm</a></li>
<li><a href="./supplemental/A06/tests/c_2.asm">./supplemental/A06/tests/c_2.asm</a> (whitespace and comments)</li>
</ul>

<p>
Your program should print the following for each of the above inputs:
</p>

<pre class="example">
1111110000010000
1110001100000110
1110001100001000
1110110000010000
1110001100001000
1110101010000111
</pre>
</div>
</div>

<div id="outline-container-org2a2e791" class="outline-2">
<h2 id="org2a2e791">Part 3: Symbol Table</h2>
<div class="outline-text-2" id="text-org2a2e791">
</div>
<div id="outline-container-orgb419774" class="outline-3">
<h3 id="orgb419774">Part 3.1: Default Table</h3>
<div class="outline-text-3" id="text-orgb419774">
<p>
Create a file, <code>st0.py</code>, containing the default symbol table that every Hack assembly program uses, as a python dictionary.
</p>

<p>
Keys in the dictionary should match the names used in the Hack assembly: <code>SCREEN</code>, <code>R13</code>, <code>SP</code>, etc.  Values for each of these keys can be found in Chapter 6.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #333333;">symbol_table</span> = {}  <span style="color: #d9d9d9;"># </span><span style="color: #7f7f7f;">fill in the table</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb184119" class="outline-3">
<h3 id="orgb184119">Part 3.2: Add Labels</h3>
<div class="outline-text-3" id="text-orgb184119">
<p>
Create a file, <code>st1.py</code>, with an updated symbol table.  This symbol table should still contain the default symbols from the previous step, but in addition should have all the labels from the input file.
</p>

<p>
Scan through the input assembly program and add labels to the symbol table.  The key in the table should be the label, without the enclosing parentheses.  The value should be the number of the instruction that immediately follows the label.
</p>
</div>
</div>

<div id="outline-container-org139ddbe" class="outline-3">
<h3 id="org139ddbe">Part 3.3: Add Variables</h3>
<div class="outline-text-3" id="text-org139ddbe">
<p>
Create a file, <code>st2.py</code>, with an updated symbol table.  It should contain the same entries from the previous step, but also contain variables from the input file.
</p>

<p>
Scan through the input assembly program again, adding variables to the symbol table.  The key should be the varialbe name, and the value should start at 16 and increment for each new variable.
</p>
</div>
</div>
</div>

<div id="outline-container-org292e33e" class="outline-2">
<h2 id="org292e33e">Appendix: Input/Output</h2>
<div class="outline-text-2" id="text-org292e33e">
<p>
Each part of this assignment should accept a filename as input from the command line, so that you can compare your program's output to the expected output for a given input.
</p>

<p>
For example, running your program would call <code>python3</code> followed by your program's name, followed finally by the input file:
</p>

<div class="org-src-container">
<pre class="src src-bash">$ python3 yourfile.py folder/to/example_input.asm
</pre>
</div>

<p>
To read a file from the command line in Python, you may use the following in your code:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #333333; font-weight: bold;">import</span> sys
<span style="color: #333333;">filename</span> = sys.argv[-<span style="color: #333333; font-weight: bold;">1</span>]
<span style="color: #333333; font-weight: bold;">with</span> <span style="color: #333333; font-weight: bold;">open</span>(filename) <span style="color: #333333; font-weight: bold;">as</span> f:
    <span style="color: #333333; font-weight: bold;">for</span> line <span style="color: #333333; font-weight: bold;">in</span> f:
        <span style="color: #333333; font-weight: bold;">print</span>(line)
</pre>
</div>

<p>
Note that if you want to iterate over the lines in <code>f</code> again, you can seek to the beginning of the file, or store the lines in a list:
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #333333; font-weight: bold;">import</span> sys
<span style="color: #333333;">filename</span> = sys.argv[-<span style="color: #333333; font-weight: bold;">1</span>]
<span style="color: #333333; font-weight: bold;">with</span> <span style="color: #333333; font-weight: bold;">open</span>(filename) <span style="color: #333333; font-weight: bold;">as</span> f:
     <span style="color: #333333; font-weight: bold;">for</span> line <span style="color: #333333; font-weight: bold;">in</span> f:
         process(line)
     f.seek(<span style="color: #333333; font-weight: bold;">0</span>)  <span style="color: #d9d9d9;"># </span><span style="color: #7f7f7f;">go back to the beginning of f</span>
     <span style="color: #333333; font-weight: bold;">for</span> line <span style="color: #333333; font-weight: bold;">in</span> f:
         process_again(line)

     <span style="color: #d9d9d9;"># </span><span style="color: #7f7f7f;">alternatively, store lines in a list:</span>
     <span style="color: #333333;">lines</span> = []
     <span style="color: #333333; font-weight: bold;">for</span> line <span style="color: #333333; font-weight: bold;">in</span> f:
         lines.append(line)
     <span style="color: #d9d9d9;"># </span><span style="color: #7f7f7f;">now you can iterate over lines multiple times:</span>
     <span style="color: #333333; font-weight: bold;">for</span> line <span style="color: #333333; font-weight: bold;">in</span> lines:
         process(line)
     <span style="color: #333333; font-weight: bold;">for</span> line <span style="color: #333333; font-weight: bold;">in</span> lines:  <span style="color: #d9d9d9;"># </span><span style="color: #7f7f7f;">no need to f.seek(0) since lines is a list</span>
         process_again(line)
</pre>
</div>
</div>
</div>
</div>
</body>
</html>
